# ※Chapter 3 - Series
(판다스 사용관련 내용)

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [53]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
df_data = pd.read_csv(data_url, sep='\s+', header = None) # CSV타입 데이터로드 , separate는 빈공간으로 지정하고, Column은 없음

In [54]:
df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [11]:
list_data = [1,2,3,4,5]
example_obj = Series(data = list_data)

example_obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
example_obj[1]

2

In [16]:
list_name =['a','b','c','d','e']
example_obj = Series(data = list_data, index = list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [17]:
example_obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [18]:
example_obj.values

array([1, 2, 3, 4, 5], dtype=int64)

In [21]:
type(example_obj.values)

numpy.ndarray

In [24]:
# 데이터를 list형식으로 넣으면 인덱스가 중복이 가능하지만 dict는 중복이 안되니까 유용하게 쓰일 수도 있음.
dict_data = {'a':1, 'b':2,'c':3,'d':4,'e':5,}
example_obj=Series(data=dict_data, dtype= np.float32, name='example_obj')
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_obj, dtype: float32

In [29]:
example_obj

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_obj, dtype: float32

In [ ]:
example_obj["a"]

In [30]:
example_obj["a"] = 3.2
example_obj

#int 형식이였다면 3.2가 3으로 변경되서 출력되었을 것.

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_obj, dtype: float32

# ※Chapter 3 - dataframe
(판다스 사용관련 내용)

In [28]:
raw_data = {'first_name':['Jason','Molly','Tina','Jake','Amy'],
           'Last_name':['Miller','Jacobson','All','Milner','Cooze'],
           'age':[42,52,36,24,73],
           'city':['San Francisco','Baltimore','Miami','Douglas','Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name','Last_name','age','city'])
df

#인덱스는 지정하지 않았으니까 0부터 인덱싱이 된다. 콜럼을 선언 안해주면
#컬럼이 abc 순서대로 들어간다. (항상 컬럼 네임을 넣어주는게 좋다.)

  first_name Last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       All   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [29]:
DataFrame(raw_data, columns=['age','city'])
#할당을 안했기 떄문에 이렇게 해도 df를 찍으면 그대로 남는다.

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [86]:
df = DataFrame(raw_data, columns=['first_name','Last_name','age','city','debt'])
df

  first_name Last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       All   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [67]:
#특정 시리즈 추출
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [68]:
#특정 시리즈 추출
df['first_name']

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [69]:
# loc 테이블의 인덱스의 액면 그대로를 불러옴
df.loc[1]

first_name        Molly
Last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [70]:
# iloc의 순서대로의 인덱스
df['age'].iloc[1:]

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [71]:
df.iloc[1:]

  first_name Last_name  age       city debt
1      Molly  Jacobson   52  Baltimore  NaN
2       Tina       All   36      Miami  NaN
3       Jake    Milner   24    Douglas  NaN
4        Amy     Cooze   73     Boston  NaN

In [72]:
a = pd.Series(data =np.nan,index=[49,48,47,46,45,1,2,3,4,5])
a

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [73]:
a.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

In [74]:
a.loc[:3]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [75]:
#Column에 새로운 데이터 할당
df.debt = df.age >40

df

  first_name Last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       All   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [76]:
df

  first_name Last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       All   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [77]:
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
Last_name          Miller   Jacobson    All   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True

In [78]:
df.T.T

  first_name Last_name age           city   debt
0      Jason    Miller  42  San Francisco   True
1      Molly  Jacobson  52      Baltimore   True
2       Tina       All  36          Miami  False
3       Jake    Milner  24        Douglas  False
4        Amy     Cooze  73         Boston   True

In [79]:
#numpy 형식으로 뽑아줌
df.values

array([['Jason', 'Miller', 42, 'San Francisco', True],
       ['Molly', 'Jacobson', 52, 'Baltimore', True],
       ['Tina', 'All', 36, 'Miami', False],
       ['Jake', 'Milner', 24, 'Douglas', False],
       ['Amy', 'Cooze', 73, 'Boston', True]], dtype=object)

In [80]:
type(df.values)

numpy.ndarray

In [81]:
#csv 파일로써 전환
df.to_csv()

',first_name,Last_name,age,city,debt\n0,Jason,Miller,42,San Francisco,True\n1,Molly,Jacobson,52,Baltimore,True\n2,Tina,All,36,Miami,False\n3,Jake,Milner,24,Douglas,False\n4,Amy,Cooze,73,Boston,True\n'

In [85]:
df

  first_name Last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       All   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [87]:
#특정한 열을 지워준다.
del df['debt']
df

  first_name Last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       All   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

# ※Chapter 3 - Missing Values
(판다스 사용관련 내용)

In [99]:
raw_data = {'first_name':['Jason',np.nan,'Tina','Jake','Amy'],
           'Last_name':['Miller',np.nan,'Ali','Milner','Cooze'],
           'age':[42,np.nan,36,24,73],
           'sex':['m',np.nan,'f','m','f'],
           'preTextScore':[4,np.nan,np.nan,2,3],
           'postTextScore':[25,np.nan,np.nan,62,70]}
df = pd.DataFrame(raw_data, columns = ['first_name','Last_name','age','sex','preTextScore','postTextScore'])
df

  first_name Last_name   age  sex  preTextScore  postTextScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [92]:
df.isnull().sum()

first_name       1
Last_name        1
age              1
sex              1
preTextScore     2
postTextScore    2
dtype: int64

In [94]:
# null이 있는 데이터들을 다 지워줌
df_no_missing = df.dropna()
df_no_missing

  first_name Last_name   age sex  preTextScore  postTextScore
0      Jason    Miller  42.0   m           4.0           25.0
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [96]:
#모든 데이터가 비어있다면 드랍해라
df_cleaned = df.dropna(how='all')
df_cleaned

  first_name Last_name   age sex  preTextScore  postTextScore
0      Jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           NaN            NaN
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [97]:
# nan 컬럼을 생성
df['location'] = np.nan
df

  first_name Last_name   age  sex  preTextScore  postTextScore  location
0      Jason    Miller  42.0    m           4.0           25.0       NaN
1        NaN       NaN   NaN  NaN           NaN            NaN       NaN
2       Tina       Ali  36.0    f           NaN            NaN       NaN
3       Jake    Milner  24.0    m           2.0           62.0       NaN
4        Amy     Cooze  73.0    f           3.0           70.0       NaN

In [98]:
# 데이터가 최소 4개 이상 없을 때 드랍
df.dropna(axis=1,thresh=3)

  first_name Last_name   age  sex  preTextScore  postTextScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [67]:
#컬럼 기준으로 삭제
df.dropna(axis=1,how='all')

  first_name Last_name   age  sex  preTextScore  postTextScore
0      Jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [102]:
df.dropna(thresh=5)

  first_name Last_name   age sex  preTextScore  postTextScore  location
0      Jason    Miller  42.0   m           4.0           25.0       NaN
3       Jake    Milner  24.0   m           2.0           62.0       NaN
4        Amy     Cooze  73.0   f           3.0           70.0       NaN

In [108]:
#해당 컬럼의 값의 평균 . 평균값
df["preTextScore"].mean()

3.0

In [105]:
#값을 나열시 중간에 위치한 값 . 중위값
df["postTextScore"].median()

62.0

In [109]:
#가장 많이 나오는 값 . 최빈값
df["postTextScore"].mode()

0    25.0
1    62.0
2    70.0
dtype: float64

In [110]:
df.fillna(0)

  first_name Last_name   age sex  preTextScore  postTextScore  location
0      Jason    Miller  42.0   m           4.0           25.0       0.0
1          0         0   0.0   0           0.0            0.0       0.0
2       Tina       Ali  36.0   f           0.0            0.0       0.0
3       Jake    Milner  24.0   m           2.0           62.0       0.0
4        Amy     Cooze  73.0   f           3.0           70.0       0.0

In [112]:
df['preTextScore'].fillna(df['preTextScore'].mean(), inplace=True)
df

  first_name Last_name   age  sex  preTextScore  postTextScore  location
0      Jason    Miller  42.0    m           4.0           25.0       NaN
1        NaN       NaN   NaN  NaN           3.0            NaN       NaN
2       Tina       Ali  36.0    f           3.0            NaN       NaN
3       Jake    Milner  24.0    m           2.0           62.0       NaN
4        Amy     Cooze  73.0    f           3.0           70.0       NaN

In [115]:
df['postTextScore'].fillna(df.groupby("sex")["postTextScore"].transform("mean"),inplace=True)
df

  first_name Last_name   age  sex  preTextScore  postTextScore  location
0      Jason    Miller  42.0    m           4.0           25.0       NaN
1        NaN       NaN   NaN  NaN           3.0            NaN       NaN
2       Tina       Ali  36.0    f           3.0           70.0       NaN
3       Jake    Milner  24.0    m           2.0           62.0       NaN
4        Amy     Cooze  73.0    f           3.0           70.0       NaN

In [117]:
df[df['age'].notnull() & df['sex'].notnull()]

  first_name Last_name   age sex  preTextScore  postTextScore  location
0      Jason    Miller  42.0   m           4.0           25.0       NaN
2       Tina       Ali  36.0   f           3.0           70.0       NaN
3       Jake    Milner  24.0   m           2.0           62.0       NaN
4        Amy     Cooze  73.0   f           3.0           70.0       NaN

# ※Chapter 3 - Category Data
(판다스 사용관련 내용 - 이산형 데이터 처리)

In [121]:
edges = pd.DataFrame({'source': [0,1,2],
                     'target': [2,2,3],
                     'weight': [3,4,5],
                      'color': ['red','blue','blue']})

In [125]:
# int 형식
edges['source']

0    0
1    1
2    2
Name: source, dtype: int64

In [126]:
# object 형식
edges['color']

0     red
1    blue
2    blue
Name: color, dtype: object

In [127]:
edges

  color  source  target  weight
0   red       0       2       3
1  blue       1       2       4
2  blue       2       3       5

In [128]:
# ONE HOT ENCODING
pd.get_dummies(edges)

   source  target  weight  color_blue  color_red
0       0       2       3           0          1
1       1       2       4           1          0
2       2       3       5           1          0